In [80]:
import pandas as pd
import numpy as np
import seaborn as sns
import scipy.stats as scp

In [81]:
data = pd.read_csv("Advertising.csv")
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [82]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [83]:
# First column is not needed, cleaning the data
data1= data.drop(["Unnamed: 0"],  axis=1)
data1

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [84]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [85]:
data1.isnull().sum()

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [86]:
# 1. To find the Maximum, Minimum, Average, Median and Percentiles
data1.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [87]:
# Maximum and Minimum spending
Max=np.max(data1)
print("The maximum spending on:  \n", Max)
Min = np.min(data1)
print("\n The minimum spending on :  \n", Min)
print("\n The maximum spending is on TV advertisements and minimum on Radio advertisements")

The maximum spending on:
 TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

 The minimum spending on :
 TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

 The maximum spending is on TV advertisements and minimum on Radio advertisements

In [88]:
# Mean, Median and Percentiles Calculation
Average = data1.mean()
print ("Average values :\n", Average)
Median = data1.median()
print ("\n Median values :\n", Median)
Percentiles = data1.quantile([0.25,0.5,0.75])
print ("\n Percentile values :\n", Percentiles)
print("\n From the calculation, it can be seen that spending for advertisements in TV is more than any medias in the dataset.")

Average values :
 TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

 Median values :
 TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

 Percentile values :
            TV   Radio  Newspaper   Sales
0.25   74.375   9.975      12.75  10.375
0.50  149.750  22.900      25.75  12.900
0.75  218.825  36.525      45.10  17.400

 From the calculation, it can be seen that spending for advertisements in TV is more than any medias in the dataset.

In [89]:
# The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper).
# For finding, ANOVA Test is used
# H0 : The same amount was spent for the three advertisements.
# Ha : The same amount was not spent for the three advertisements.

In [90]:
fstatistic,pvalue= scp.f_oneway(data1['TV'], data1['Radio'], data1['Newspaper'])
print("F value :", fstatistic)
print("p value :" , pvalue)
print('significance level=0.05')

F value : 358.8514595342597
p value : 4.552931539744962e-103
significance level=0.05

In [91]:
print("From the test, it can be seen that p value is less than signifance level,so we have amble evidences to reject null hypothesis. Therefore, as per analysis, the same amount was not spent for the three advertisements. ")

From the test, it can be seen that p value is less than signifance level,so we have amble evidences to reject null hypothesis. Therefore, as per analysis, the same amount was not spent for the three advertisements.